Codeigniter/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin12'
 LIMIT 1
---
    public function loginProcess()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $model->where('username', $username)->first();