Codeigniter/app/Controllers/TaskController.php

   public function index() {
    if (!session()->get('isLoggedIn')) return redirect()->to('/login');

    $taskModel = new TaskModel();
    $userModel = new UserModel();
    $data['tasks'] = $taskModel->findAll();
    $data['all_users'] = $userModel->findAll();
---
SELECT *
FROM `tasks`
SELECT *
FROM `users`

   public function create() {
    $model = new TaskModel();

    $data = [
        'title'   => $this->request->getPost('title'),
        // Automatically assign to current user, removing the dropdown dependency
        'user_id' => session()->get('user_id'),
        'status'  => 'pending'
    ];

    if ($model->insert($data)) {
---
INSERT INTO `tasks` (`title`, `user_id`, `status`) VALUES ('maglaro ng ml', NULL, 'pending')

    public function edit($id = null) {
        $taskModel = new TaskModel();
        $userModel = new UserModel();
        $data['task'] = $taskModel->find($id);
        $data['all_users'] = $userModel->findAll();
---
SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '8'
SELECT *
FROM `users`

    public function delete($id = null) {
        $model = new TaskModel();
        $existing = $model->find($id);

        if (!$existing) {
            return redirect()->to('/tasks')->with('error', 'Task does not exist.');
        }

        if ($model->delete($id)) {
---
SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '6'
DELETE FROM `tasks`
WHERE `id` IN ('6')